<span>
<img src="http://www.sobigdata.eu/sites/default/files/logo-SoBigData-DEFINITIVO.png" width="180px" align="right"/>
</span>
<span>
<b>Author:</b> <a href="http://about.giuliorossetti.net">Giulio Rossetti</a><br/>
<b>Python version:</b>  3.x<br/>
<b>Last update:</b> 12/12/2017
</span>

<a id='top'></a>
# *Data Manipulation with Pandas*

In [ ]:
import numpy as np
import pandas as pd

## 1. Series
Pandas Series can be build by leveraging different data types

From numerical data

In [75]:
my_data = [10,20,30]
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

From numerical data and corresponding index (row labels)

In [76]:
labels = ['A','B','C']
pd.Series(data=my_data, index=labels)

A    10
B    20
C    30
dtype: int64

Just using a pre-defined dictionary

In [77]:
d = {'A':10,'B':20,'C':30}
pd.Series(d)

A    10
B    20
C    30
dtype: int64

### 1.2 Indexing and Slicing
Series can be indexed and sliced

In [79]:
ser = pd.Series([1, 2, 3, 4], ['A', 'B', 'C', 'D'])

print("by name, A:", ser['A'])
print("by positional value in the series, A:", ser[0])
print("by range, B:D\n", ser[1:4], sep='')

by name, A: 1
by positional value in the series, A: 1
by range, B:D
B    2
C    3
D    4
dtype: int64

### 1.3 Adding/Merging two Series having common indices

In [80]:
ser1 = pd.Series([1, 2, 3, 4], ['A', 'B', 'C', 'D'])
ser2 = pd.Series([1, 2, 5, 4], ['A', 'B', 'E', 'D'])
ser3 = ser1+ser2

After adding the two series, the result looks like this...

In [81]:
ser3

A    2.0
B    4.0
C    NaN
D    8.0
E    NaN
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing <br/>
The same happens for all possible operations (e.g., product)

In [82]:
ser1*ser2

A     1.0
B     4.0
C     NaN
D    16.0
E     NaN
dtype: float64

## 4. DataFrame

In [157]:
from numpy.random import randn as rn

### 4.1 Creating and accessing DataFrame
We start generating some random data...

In [158]:
np.random.seed()
matrix_data = rn(5,4)
matrix_data

array([[-0.6566564 , -0.47280545,  0.1354953 ,  0.91744833],
       [-0.61597918, -0.51307342,  0.33450237, -0.23862023],
       [ 1.41217901, -0.04277876,  0.67502066,  0.47739812],
       [-0.3913604 , -0.43722113,  0.98600403, -1.23689387],
       [ 0.63580697,  0.36742478,  0.46672082,  0.07552234]])

Now we can transform such random matrix in a DataFrame

In [159]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
df

          W         X         Y         Z
A -0.656656 -0.472805  0.135495  0.917448
B -0.615979 -0.513073  0.334502 -0.238620
C  1.412179 -0.042779  0.675021  0.477398
D -0.391360 -0.437221  0.986004 -1.236894
E  0.635807  0.367425  0.466721  0.075522

Simple statistics can be obtained through the *describe* method

### 4.2 Loading a DataFrame from csv file
Datasets formatted as csv files can be easily loaded into a DataFrame

In [422]:
titanic = pd.read_csv("data/titanic_passengers.csv")

In [423]:
titanic.head()

,PassengerId,Name,Sex,Age,SibSp,Parch
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,5,"Allen, Mr. William Henry",male,35.0,0,0

In [425]:
titanic.describe()

       PassengerId         Age       SibSp       Parch
count   891.000000  714.000000  891.000000  891.000000
mean    446.000000   29.699118    0.523008    0.381594
std     257.353842   14.526497    1.102743    0.806057
min       1.000000    0.420000    0.000000    0.000000
25%     223.500000   20.125000    0.000000    0.000000
50%     446.000000   28.000000    0.000000    0.000000
75%     668.500000   38.000000    1.000000    0.000000
max     891.000000   80.000000    8.000000    6.000000

### 4.2 Indexing and slicing (columns)

Slicing a single column produces a Series...

In [426]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5       NaN
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      NaN
18     31.0
19      NaN
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26      NaN
27     19.0
28      NaN
29      NaN
       ...
861    21.0
862    48.0
863     NaN
864    24.0
865    42.0
866    27.0
867    31.0
868     NaN
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878     NaN
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [427]:
type(titanic['Age'])

pandas.core.series.Series

An alternative syntax to access a single column is the *dot* notation

In [428]:
titanic.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5       NaN
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      NaN
18     31.0
19      NaN
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26      NaN
27     19.0
28      NaN
29      NaN
       ...
861    21.0
862    48.0
863     NaN
864    24.0
865    42.0
866    27.0
867    31.0
868     NaN
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878     NaN
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

#### Unique values

In [514]:
titanic['Age'].unique()

array([ 38.  ,  26.  ,  35.  ,    nan,  54.  ,   2.  ,  27.  ,  14.  ,
         4.  ,  58.  ,  20.  ,  39.  ,  55.  ,  31.  ,  34.  ,  15.  ,
        28.  ,   8.  ,  19.  ,  40.  ,  66.  ,  42.  ,  21.  ,  18.  ,
         3.  ,   7.  ,  49.  ,  29.  ,  65.  ,  28.5 ,   5.  ,  11.  ,
        22.  ,  45.  ,  17.  ,  32.  ,  16.  ,  25.  ,   0.83,  30.  ,
        33.  ,  23.  ,  24.  ,  46.  ,  59.  ,  71.  ,  37.  ,  47.  ,
        14.5 ,  70.5 ,  32.5 ,  12.  ,   9.  ,  36.5 ,  51.  ,  55.5 ,
        40.5 ,  44.  ,   1.  ,  61.  ,  56.  ,  50.  ,  36.  ,  45.5 ,
        20.5 ,  62.  ,  41.  ,  52.  ,  63.  ,  23.5 ,   0.92,  43.  ,
        60.  ,  10.  ,  64.  ,  13.  ,  48.  ,   0.75,  53.  ,  57.  ,
        80.  ,  70.  ,  24.5 ,   6.  ,   0.67,  30.5 ,   0.42,  34.5 ,  74.  ])

In [515]:
titanic['Age'].value_counts()

24.00    30
22.00    26
18.00    26
30.00    25
28.00    25
19.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
34.00    15
23.00    15
39.00    14
42.00    13
40.00    13
17.00    13
45.00    12
38.00    11
50.00    10
4.00     10
2.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
45.50     2
40.50     2
32.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
66.00     1
36.50     1
53.00     1
55.50     1
70.50     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

#### DataFrame Filter

To obtain a DataFrame an additional bracket must be used

In [429]:
titanic[['Age']].head()

    Age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [430]:
type(titanic[['Age']])

pandas.core.frame.DataFrame

In [431]:
titanic[['Age','Sex']].head() # Multiple selection

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

### 4.3 Creating and deleting a (new) column (or row)

Adding a novel column combining existing ones

In [432]:
titanic['Family'] = titanic['SibSp'] + titanic['Parch']
titanic.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Family
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,1
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,0

Deleting an existing column

In [433]:
titanic = titanic.drop('Parch', axis=1)
titanic = titanic.drop('SibSp', axis=1)
titanic

,PassengerId,Name,Sex,Age,Family
0,1,"Braund, Mr. Owen Harris",male,22.0,1
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
4,5,"Allen, Mr. William Henry",male,35.0,0
5,6,"Moran, Mr. James",male,NaN,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0
7,8,"Palsson, Master. Gosta Leonard",male,2.0,4
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,2
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,2
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0
12,13,"Saundercock, Mr. William Henry",male,20.0,0
13,14,"Andersson, Mr. Anders Johan",male,39.0,6
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0
16,17,"Rice, Master. Eugene",male,2.0,5
17,18,"Williams, Mr. Charles Eugene",male,NaN,0
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1
19,20,"Masselmani, Mrs. Fatima",female,NaN,0
20,21,"Fynney, Mr. Joseph J",male,35.0,0
21,22,"Beesley, Mr. Lawrence",male,34.0,0
22,23,"McGowan, Miss. Anna ""Annie""",female,15.0,0
23,24,"Sloper, Mr. William Thompson",male,28.0,0
24,25,"Palsson, Miss. Torborg Danira",female,8.0,4
25,26,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,6
26,27,"Emir, Mr. Farred Chehab",male,NaN,0
27,28,"Fortune, Mr. Charles Alexander",male,19.0,5
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0
29,30,"Todoroff, Mr. Lalio",male,NaN,0
...,...,...,...,...,...
861,862,"Giles, Mr. Frederick Edward",male,21.0,1
862,863,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,10
864,865,"Gill, Mr. John William",male,24.0,0
865,866,"Bystrom, Mrs. (Karolina)",female,42.0,0
866,867,"Duran y More, Miss. Asuncion",female,27.0,1
867,868,"Roebling, Mr. Washington Augustus II",male,31.0,0
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0
869,870,"Johnson, Master. Harold Theodor",male,4.0,2
870,871,"Balkic, Mr. Cerin",male,26.0,0
871,872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,2
872,873,"Carlsson, Mr. Frans Olof",male,33.0,0
873,874,"Vander Cruyssen, Mr. Victor",male,47.0,0
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1
875,876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0
876,877,"Gustafsson, Mr. Alfred Ossian",male,20.0,0
877,878,"Petroff, Mr. Nedelio",male,19.0,0
878,879,"Laleff, Mr. Kristo",male,NaN,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1
881,882,"Markun, Mr. Johann",male,33.0,0
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0
883,884,"Banfield, Mr. Frederick James",male,28.0,0
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,5
886,887,"Montvila, Rev. Juozas",male,27.0,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,3
889,890,"Behr, Mr. Karl Howell",male,26.0,0
890,891,"Dooley, Mr. Patrick",male,32.0,0

Deleting a row (index) by using df.drop() method and axis=0

In [434]:
titanic1 = titanic.drop(0, axis=0)
titanic1

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
4,5,"Allen, Mr. William Henry",male,35.0,0
5,6,"Moran, Mr. James",male,NaN,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0
7,8,"Palsson, Master. Gosta Leonard",male,2.0,4
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,2
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,2
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0
12,13,"Saundercock, Mr. William Henry",male,20.0,0
13,14,"Andersson, Mr. Anders Johan",male,39.0,6
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0
16,17,"Rice, Master. Eugene",male,2.0,5
17,18,"Williams, Mr. Charles Eugene",male,NaN,0
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1
19,20,"Masselmani, Mrs. Fatima",female,NaN,0
20,21,"Fynney, Mr. Joseph J",male,35.0,0
21,22,"Beesley, Mr. Lawrence",male,34.0,0
22,23,"McGowan, Miss. Anna ""Annie""",female,15.0,0
23,24,"Sloper, Mr. William Thompson",male,28.0,0
24,25,"Palsson, Miss. Torborg Danira",female,8.0,4
25,26,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,6
26,27,"Emir, Mr. Farred Chehab",male,NaN,0
27,28,"Fortune, Mr. Charles Alexander",male,19.0,5
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0
29,30,"Todoroff, Mr. Lalio",male,NaN,0
30,31,"Uruchurtu, Don. Manuel E",male,40.0,0
...,...,...,...,...,...
861,862,"Giles, Mr. Frederick Edward",male,21.0,1
862,863,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,10
864,865,"Gill, Mr. John William",male,24.0,0
865,866,"Bystrom, Mrs. (Karolina)",female,42.0,0
866,867,"Duran y More, Miss. Asuncion",female,27.0,1
867,868,"Roebling, Mr. Washington Augustus II",male,31.0,0
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0
869,870,"Johnson, Master. Harold Theodor",male,4.0,2
870,871,"Balkic, Mr. Cerin",male,26.0,0
871,872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,2
872,873,"Carlsson, Mr. Frans Olof",male,33.0,0
873,874,"Vander Cruyssen, Mr. Victor",male,47.0,0
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1
875,876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0
876,877,"Gustafsson, Mr. Alfred Ossian",male,20.0,0
877,878,"Petroff, Mr. Nedelio",male,19.0,0
878,879,"Laleff, Mr. Kristo",male,NaN,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1
881,882,"Markun, Mr. Johann",male,33.0,0
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0
883,884,"Banfield, Mr. Frederick James",male,28.0,0
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,5
886,887,"Montvila, Rev. Juozas",male,27.0,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,3
889,890,"Behr, Mr. Karl Howell",male,26.0,0
890,891,"Dooley, Mr. Patrick",male,32.0,0

Updates can be performed **inplace** (without reasigning to a variable) by setting inplace=True

In [435]:
titanic.drop(0, axis=0, inplace=True)
titanic

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
4,5,"Allen, Mr. William Henry",male,35.0,0
5,6,"Moran, Mr. James",male,NaN,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0
7,8,"Palsson, Master. Gosta Leonard",male,2.0,4
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,2
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,2
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0
12,13,"Saundercock, Mr. William Henry",male,20.0,0
13,14,"Andersson, Mr. Anders Johan",male,39.0,6
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0
16,17,"Rice, Master. Eugene",male,2.0,5
17,18,"Williams, Mr. Charles Eugene",male,NaN,0
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1
19,20,"Masselmani, Mrs. Fatima",female,NaN,0
20,21,"Fynney, Mr. Joseph J",male,35.0,0
21,22,"Beesley, Mr. Lawrence",male,34.0,0
22,23,"McGowan, Miss. Anna ""Annie""",female,15.0,0
23,24,"Sloper, Mr. William Thompson",male,28.0,0
24,25,"Palsson, Miss. Torborg Danira",female,8.0,4
25,26,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,6
26,27,"Emir, Mr. Farred Chehab",male,NaN,0
27,28,"Fortune, Mr. Charles Alexander",male,19.0,5
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0
29,30,"Todoroff, Mr. Lalio",male,NaN,0
30,31,"Uruchurtu, Don. Manuel E",male,40.0,0
...,...,...,...,...,...
861,862,"Giles, Mr. Frederick Edward",male,21.0,1
862,863,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,10
864,865,"Gill, Mr. John William",male,24.0,0
865,866,"Bystrom, Mrs. (Karolina)",female,42.0,0
866,867,"Duran y More, Miss. Asuncion",female,27.0,1
867,868,"Roebling, Mr. Washington Augustus II",male,31.0,0
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0
869,870,"Johnson, Master. Harold Theodor",male,4.0,2
870,871,"Balkic, Mr. Cerin",male,26.0,0
871,872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,2
872,873,"Carlsson, Mr. Frans Olof",male,33.0,0
873,874,"Vander Cruyssen, Mr. Victor",male,47.0,0
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1
875,876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0
876,877,"Gustafsson, Mr. Alfred Ossian",male,20.0,0
877,878,"Petroff, Mr. Nedelio",male,19.0,0
878,879,"Laleff, Mr. Kristo",male,NaN,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1
881,882,"Markun, Mr. Johann",male,33.0,0
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0
883,884,"Banfield, Mr. Frederick James",male,28.0,0
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,5
886,887,"Montvila, Rev. Juozas",male,27.0,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,3
889,890,"Behr, Mr. Karl Howell",male,26.0,0
890,891,"Dooley, Mr. Patrick",male,32.0,0

### 4.4 Selecting/indexing Rows
Rows can be indexed by **label** as well as by **index**

In [436]:
titanic.loc[[1, 2]]

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0

In [437]:
titanic.iloc[[1,2]]

,PassengerId,Name,Sex,Age,Family
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1

### 4.5 Subsetting DataFrame
Accessing an element in position (D,Y)

In [438]:
titanic.loc[2,'Age']

26.0

Slicing by rows and columns at the same time

In [439]:
titanic.loc[[2, 3],['Age','Sex']]

    Age     Sex
2  26.0  female
3  35.0  female

### 4.6 Conditional selection
Logical operators can be applied to DataFrame to perform filtering and selections

**Example:** a boolean DataFrame where we are checking if the values are greater than 0

In [440]:
booldf = titanic>0
booldf.head()

   PassengerId  Name   Sex    Age  Family
1         True  True  True   True    True
2         True  True  True   True   False
3         True  True  True   True    True
4         True  True  True   True   False
5         True  True  True  False   False

A bolean DataFrame can also be used to filter the original values

In [441]:
titanic[booldf].head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0
2,3,"Heikkinen, Miss. Laina",female,26.0,NaN
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0
4,5,"Allen, Mr. William Henry",male,35.0,NaN
5,6,"Moran, Mr. James",male,NaN,NaN

### 4.7 Conditionally subset a DataFrame with Boolean series
Let's define a DataFrame describing individuals measurements

We can filter it easily by specifying a condition on the cell values

In [443]:
titanic[titanic['Age']>35].head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
6,7,"McCarthy, Mr. Timothy J",male,54.0,0
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0
13,14,"Andersson, Mr. Anders Johan",male,39.0,6
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0

Multiple conditions can be stacked together using boolean operators

In [444]:
booldf1 = titanic['Age']>35
booldf2 = titanic['Family']>2

In [445]:
booldf2

1      False
2      False
3      False
4      False
5      False
6      False
7       True
8      False
9      False
10     False
11     False
12     False
13      True
14     False
15     False
16      True
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24      True
25      True
26     False
27      True
28     False
29     False
30     False
       ...
861    False
862    False
863     True
864    False
865    False
866    False
867    False
868    False
869    False
870    False
871    False
872    False
873    False
874    False
875    False
876    False
877    False
878    False
879    False
880    False
881    False
882    False
883    False
884    False
885     True
886    False
887    False
888     True
889    False
890    False
Name: Family, Length: 890, dtype: bool

In [446]:
titanic[(booldf1) & (booldf2)].head()

,PassengerId,Name,Sex,Age,Family
13,14,"Andersson, Mr. Anders Johan",male,39.0,6
25,26,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,6
167,168,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,5
360,361,"Skoog, Mr. Wilhelm",male,40.0,5
390,391,"Carter, Mr. William Ernest",male,36.0,3

Filtering results can be subsetted as usual selecting rows/columns

In [447]:
titanic[booldf1][['Age','Sex']].head()

     Age     Sex
1   38.0  female
6   54.0    male
11  58.0  female
13  39.0    male
15  55.0  female

### 4.8 Re-setting and Setting Index
In the previuos example we specified an index. <br/>
We can destroy such index (making it a simple column of the DataFrame) easily

In [449]:
titanic.reset_index().head()

,index,PassengerId,Name,Sex,Age,Family
0,1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
1,2,3,"Heikkinen, Miss. Laina",female,26.0,0
2,3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
3,4,5,"Allen, Mr. William Henry",male,35.0,0
4,5,6,"Moran, Mr. James",male,NaN,0

Conversely, if we do not need such additional column we can drop it contextually

In [450]:
titanic.reset_index(drop=True).head()

,PassengerId,Name,Sex,Age,Family
0,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
1,3,"Heikkinen, Miss. Laina",female,26.0,0
2,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
3,5,"Allen, Mr. William Henry",male,35.0,0
4,6,"Moran, Mr. James",male,NaN,0

Now we can add a new column and set it as new index

In [452]:
titanic.set_index('Name').head()

,PassengerId,Sex,Age,Family
Name,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,female,38.0,1
"Heikkinen, Miss. Laina",3,female,26.0,0
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,female,35.0,1
"Allen, Mr. William Henry",5,male,35.0,0
"Moran, Mr. James",6,male,NaN,0

### 4.9 Multi-indexing
DataFrame indexes can have multiple levels <br/>
We can define a two level index as follows:

In [453]:
t2 = titanic[['Name', 'Family', 'Age']]
t2.head()

                                                Name  Family   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1  38.0
2                             Heikkinen, Miss. Laina       0  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1  35.0
4                           Allen, Mr. William Henry       0  35.0
5                                   Moran, Mr. James       0   NaN

In [454]:
t2.set_index(['Family', 'Age'], inplace=True)

For sake of clarity we can rename the indexes as follows

In [455]:
t2.index.names=['Outer', 'Inner']
t2.head()

                                                          Name
Outer Inner
1     38.0   Cumings, Mrs. John Bradley (Florence Briggs Th...
0     26.0                              Heikkinen, Miss. Laina
1     35.0        Futrelle, Mrs. Jacques Heath (Lily May Peel)
0     35.0                            Allen, Mr. William Henry
      NaN                                     Moran, Mr. James

Subsetting now becomes trikier, but the syntax remains the same. <br/>
We can select the subset (38.0)(Name) of Outer=1 by using the *loc* function twice

In [460]:
t2.loc[1].loc[[38.0]][['Name']]

                                                    Name
Inner
38.0   Cumings, Mrs. John Bradley (Florence Briggs Th...
38.0                        Hoyt, Mr. Frederick Maxfield
38.0                           Graham, Mr. George Edward

## 5. Data Transformation

### 5.1 Missing Values
In presence of missing values different policies can be selected

#### Dropping any rows with a NaN value

In [461]:
titanic.dropna(axis=0).head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
4,5,"Allen, Mr. William Henry",male,35.0,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0

#### Dropping any columns with NaN value

In [462]:
titanic.dropna(axis=1).head()

,PassengerId,Name,Sex,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1
2,3,"Heikkinen, Miss. Laina",female,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1
4,5,"Allen, Mr. William Henry",male,0
5,6,"Moran, Mr. James",male,0

#### Thresholding: dropping a row with a minimum 5 NaN

In [467]:
titanic.dropna(axis=0, thresh=5).head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1
4,5,"Allen, Mr. William Henry",male,35.0,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0

#### Filling values with a default value

In [468]:
titanic.fillna(value='FILL VALUE').head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1
2,3,"Heikkinen, Miss. Laina",female,26,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1
4,5,"Allen, Mr. William Henry",male,35,0
5,6,"Moran, Mr. James",male,FILL VALUE,0

#### Filling values with a computed value (e.g., mean of column A)

In [469]:
titanic.fillna(value={'Age': titanic['Age'].mean()}).head()

,PassengerId,Name,Sex,Age,Family
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1
2,3,"Heikkinen, Miss. Laina",female,26.000000,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1
4,5,"Allen, Mr. William Henry",male,35.000000,0
5,6,"Moran, Mr. James",male,29.709916,0

### 5.2 GroupBy
DataFrames allow to group rows by column values so to compute aggregated statistics (i.e., sum, mean...)

In [471]:
t3 = titanic.groupby('Family')
t3[['Age']].mean()

              Age
Family
0       32.220297
1       31.459565
2       26.035806
3       18.274815
4       20.818182
5       18.409091
6       15.166667
7       15.666667
10            NaN

In [479]:
t4 = pd.DataFrame(titanic[['Age', 'Family']].groupby('Family').describe())
t4

          Age
        count       mean        std   min    25%   50%    75%   max
Family
0       404.0  32.220297  12.899871  5.00  22.00  29.5  39.00  80.0
1       138.0  31.459565  13.509524  0.42  22.00  29.5  42.00  65.0
2        93.0  26.035806  16.542123  0.67  15.00  27.0  37.00  70.0
3        27.0  18.274815  14.304131  0.75   3.50  23.0  28.00  48.0
4        11.0  20.818182  17.069377  2.00   8.50  18.0  25.00  54.0
5        22.0  18.409091  17.388171  1.00   4.75  12.0  24.00  64.0
6        12.0  15.166667  14.732977  2.00   4.75   9.0  22.25  39.0
7         6.0  15.666667  14.361987  1.00   9.50  12.5  15.50  43.0
10        0.0        NaN        NaN   NaN    NaN   NaN    NaN   NaN

In order to select a single row of the resulting DataFrame it is necessary to:
- access it via *loc*
- transpose the results

In [480]:
titanic_first_class = pd.DataFrame(t4.loc[1])
titanic_first_class

                    1
Age count  138.000000
    mean    31.459565
    std     13.509524
    min      0.420000
    25%     22.000000
    50%     29.500000
    75%     42.000000
    max     65.000000

In [481]:
titanic_first_class.transpose()

     Age
   count       mean        std   min   25%   50%   75%   max
1  138.0  31.459565  13.509524  0.42  22.0  29.5  42.0  65.0

The latter operation is not required if the selection is on multiple rows

In [484]:
titanic[['Age', 'Family']].groupby('Family').describe().loc[[1, 2, 3]]

          Age
        count       mean        std   min   25%   50%   75%   max
Family
1       138.0  31.459565  13.509524  0.42  22.0  29.5  42.0  65.0
2        93.0  26.035806  16.542123  0.67  15.0  27.0  37.0  70.0
3        27.0  18.274815  14.304131  0.75   3.5  23.0  28.0  48.0

### 5.3 Concatenating DataFrames

In [497]:
trip = pd.read_csv("data/titanic_status.csv")
trip.head()

   PassengerId  Survived  Pclass Embarked Cabin            Ticket     Fare
0            2         1       1        C   C85          PC 17599  71.2833
1            3         1       3        S   NaN  STON/O2. 3101282   7.9250
2            4         1       1        S  C123            113803  53.1000
3            5         0       3        S   NaN            373450   8.0500
4            6         0       3        Q   NaN            330877   8.4583

In [498]:
passengers = pd.read_csv("data/titanic_passengers.csv")
passengers.head()

,PassengerId,Name,Sex,Age,SibSp,Parch
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0
4,5,"Allen, Mr. William Henry",male,35.0,0,0

#### Concatenation

In [500]:
row_concat = pd.concat([passengers, trip], axis=0)
row_concat.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,NaN,NaN,"Braund, Mr. Owen Harris",0.0,1,NaN,male,1.0,NaN,NaN
1,38.0,NaN,NaN,NaN,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0.0,2,NaN,female,1.0,NaN,NaN
2,26.0,NaN,NaN,NaN,"Heikkinen, Miss. Laina",0.0,3,NaN,female,0.0,NaN,NaN
3,35.0,NaN,NaN,NaN,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0.0,4,NaN,female,1.0,NaN,NaN
4,35.0,NaN,NaN,NaN,"Allen, Mr. William Henry",0.0,5,NaN,male,0.0,NaN,NaN

In [513]:
column_concat = pd.concat([passengers, trip], axis=1)
column_concat.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,2.0,1.0,1.0,C,C85,PC 17599,71.2833
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,3.0,1.0,3.0,S,NaN,STON/O2. 3101282,7.9250
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,4.0,1.0,1.0,S,C123,113803,53.1000
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,5.0,0.0,3.0,S,NaN,373450,8.0500
4,5,"Allen, Mr. William Henry",male,35.0,0,0,6.0,0.0,3.0,Q,NaN,330877,8.4583

Filling NaN with a fixed value

In [503]:
column_concat.fillna(value=0, inplace=True)
column_concat.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,PassengerId,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,2.0,1.0,1.0,C,C85,PC 17599,71.2833
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,3.0,1.0,3.0,S,0,STON/O2. 3101282,7.9250
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,4.0,1.0,1.0,S,C123,113803,53.1000
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,5.0,0.0,3.0,S,0,373450,8.0500
4,5,"Allen, Mr. William Henry",male,35.0,0,0,6.0,0.0,3.0,Q,0,330877,8.4583

### 5.4 Merging DataFrames

#### Merging by a common 'key'
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [512]:
merge1 = pd.merge(passengers, trip, how='inner',on=['PassengerId'])
merge1.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,1,C,C85,PC 17599,71.2833
1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,3,S,NaN,STON/O2. 3101282,7.9250
2,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,1,S,C123,113803,53.1000
3,5,"Allen, Mr. William Henry",male,35.0,0,0,0,3,S,NaN,373450,8.0500
4,6,"Moran, Mr. James",male,NaN,0,0,0,3,Q,NaN,330877,8.4583

In [511]:
pd.merge(passengers, trip, how='outer',on=['PassengerId']).head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1.0,1.0,C,C85,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,1.0,3.0,S,NaN,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1.0,1.0,S,C123,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,0,0.0,3.0,S,NaN,373450,8.0500

In [509]:
pd.merge(passengers, trip, how='left',on=['PassengerId']).head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1.0,1.0,C,C85,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,1.0,3.0,S,NaN,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1.0,1.0,S,C123,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,0,0.0,3.0,S,NaN,373450,8.0500

In [510]:
pd.merge(passengers, trip, how='right',on=['PassengerId']).head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Survived,Pclass,Embarked,Cabin,Ticket,Fare
0,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,1,1,C,C85,PC 17599,71.2833
1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,1,3,S,NaN,STON/O2. 3101282,7.9250
2,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,1,1,S,C123,113803,53.1000
3,5,"Allen, Mr. William Henry",male,35.0,0,0,0,3,S,NaN,373450,8.0500
4,6,"Moran, Mr. James",male,NaN,0,0,0,3,Q,NaN,330877,8.4583

### 5.6 Joining DataFrames
Joining is a convenient method for combining the columns of two **potentially differently-indexed** DataFrames into a single DataFrame based on 'index keys'.

In [227]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [228]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [229]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### 5.7 Additional DataFrame operations

#### Applying functions to DataFrame values
Pandas works with 'apply' method to accept any user-defined function...

In [533]:
# Define a function
def adulthood(x):
    if x<18:
        return False
    else:
        return True

In [534]:
passengers['Adult'] = passengers['Age'].apply(adulthood)
passengers.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Adult
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,True
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,True
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,True
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,True
4,5,"Allen, Mr. William Henry",male,35.0,0,0,True

... as well as with **built-in ones**

In [535]:
passengers['Name Length']= passengers['Name'].apply(len)
passengers.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Adult,Name Length
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,True,23
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,True,51
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,True,22
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,True,44
4,5,"Allen, Mr. William Henry",male,35.0,0,0,True,24

#### Standard statistical functions

In [536]:
passengers['Age'].max()

80.0

In [537]:
passengers['Age'].mean()

29.69911764705882

In [538]:
passengers['Age'].std()

14.526497332334042

In [539]:
passengers['Age'].min()

0.41999999999999998

#### Get the list of column and row names

Getting column names

In [540]:
passengers.columns

Index(['PassengerId', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Adult',
       'Name Length'],
      dtype='object')

#### Deletion by *del* command 
(N.B.: This affects the dataframe immediately, unlike drop method)

In [541]:
del passengers['Name Length']
passengers.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Adult
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,True
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,True
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,True
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,True
4,5,"Allen, Mr. William Henry",male,35.0,0,0,True

#### Sorting and Ordering a DataFrame

In [543]:
passengers.sort_values(by='Age').head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Adult
803,804,"Thomas, Master. Assad Alexander",male,0.42,0,1,False
755,756,"Hamalainen, Master. Viljo",male,0.67,1,1,False
644,645,"Baclini, Miss. Eugenie",female,0.75,2,1,False
469,470,"Baclini, Miss. Helene Barbara",female,0.75,2,1,False
78,79,"Caldwell, Master. Alden Gates",male,0.83,0,2,False

In [544]:
passengers.sort_values(by='Age',ascending=False).head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Adult
630,631,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,True
851,852,"Svensson, Mr. Johan",male,74.0,0,0,True
493,494,"Artagaveytia, Mr. Ramon",male,71.0,0,0,True
96,97,"Goldschmidt, Mr. George B",male,71.0,0,0,True
116,117,"Connors, Mr. Patrick",male,70.5,0,0,True

#### Find Null Values or Check for Null Values

In [547]:
full_data.isnull().head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,False,True,True,True,False,False,False,True,False,False,True,True
1,False,True,True,True,False,False,False,True,False,False,True,True
2,False,True,True,True,False,False,False,True,False,False,True,True
3,False,True,True,True,False,False,False,True,False,False,True,True
4,False,True,True,True,False,False,False,True,False,False,True,True

In [548]:
full_data.fillna('FAKE VALUE').head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22,FAKE VALUE,FAKE VALUE,FAKE VALUE,"Braund, Mr. Owen Harris",0,1,FAKE VALUE,male,1,FAKE VALUE,FAKE VALUE
1,38,FAKE VALUE,FAKE VALUE,FAKE VALUE,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,FAKE VALUE,female,1,FAKE VALUE,FAKE VALUE
2,26,FAKE VALUE,FAKE VALUE,FAKE VALUE,"Heikkinen, Miss. Laina",0,3,FAKE VALUE,female,0,FAKE VALUE,FAKE VALUE
3,35,FAKE VALUE,FAKE VALUE,FAKE VALUE,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,FAKE VALUE,female,1,FAKE VALUE,FAKE VALUE
4,35,FAKE VALUE,FAKE VALUE,FAKE VALUE,"Allen, Mr. William Henry",0,5,FAKE VALUE,male,0,FAKE VALUE,FAKE VALUE

#### Pivot Table

In [549]:
# Index out of 'Age', columns from 'SibSp', actual numerical values from 'Age'
passengers.pivot_table(values='Age',index=['Sex'],columns=['SibSp'])

SibSp           0          1          2      3         4      5
Sex
female  28.631944  30.738889  16.541667  16.50  8.333333  16.00
male    32.615443  29.461505  28.230769   8.75  6.416667   8.75

In [552]:
# Index out of 'SibSp' and 'Parch', columns from 'Sex', actual numerical values from 'Age'
passengers.pivot_table(values='Age',index=['SibSp', 'Parch'],columns=['Sex'], fill_value='FILLED')

Sex           female     male
SibSp Parch
0     0        30.15  32.9013
      1       27.087    33.53
      2      20.7059  21.5367
      3           24   FILLED
      4           29   FILLED
      5           40   FILLED
1     0      31.8061  32.3113
      1        29.16  25.2586
      2         21.2  19.4171
      3           51       16
      4           45       52
      5         38.5       39
      6           43   FILLED
2     0         35.5  31.1818
      1          6.9       12
      2        17.25   FILLED
      3           24   FILLED
3     0         31.5   FILLED
      1          5.5        2
      2         14.5       11
4     1       FILLED  6.77778
      2      8.33333  5.33333
5     2           16     8.75
8     2       FILLED   FILLED